stress-test.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up the application"
    - duration: 120
      arrivalRate: 1
      rampTo: 5
      name: "jump to max load"
    - duration: 120
      arrivalRate: 6
      name: "keep at the max load"
    - duration: 60
      arrivalRate: 6
      rampTo: 1
      name: "calm down"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
    - flow:
        - loop:
            - get:
                url: "/overviews/restaurant/{{$randomNumber(9000000, 10000000)}}/overview"
          count: 100